cask_args appdir: "~/Applications"



## Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "llvm-hs/llvm"
tap "neovim/neovim"



## Free/Open Source


### Development

#### C++
brew "cmake"
brew "ctags"
brew "gcc"
brew "gdb"
brew "llvm"
brew "ninja"

#### Go
brew "go"

#### Haskell
brew "haskell-stack"

#### Java
brew "ant"
brew "gradle"
brew "maven"
cask "adoptopenjdk"
cask "adoptopenjdk8"

#### Latex
cask "mactex"

#### Node
brew "node"
brew "nvm"
brew "vips"
brew "yarn"

#### Python
brew "python@3"
brew "pyenv"

#### Rust
brew "rustup-init"
brew "wasm-pack"

#### Scala
brew "sbt"
brew "scala"

#### Version Control
brew "git"
brew "hg"

#### Editors
cask "macvim"

#### Command Line Tools
brew "atomicparsley"
brew "axel"
brew "exa"
brew "ffmpeg"
brew "htop"
brew "mas"
brew "mosh"
brew "pandoc"
brew "parallel"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"


### Apps

#### Browsers
cask "opera"
cask "eloston-chromium"
cask "firefox"

#### Multiemedia
cask "vlc"
cask "iina"                 # video player

#### Utilities
cask "appcleaner"           # app uninstaller
cask "calibre"              # ebook management
cask "dash"                 # docs search
cask "docker"               # container runtime
cask "fluor"                # fn key switcher
cask "fsnotes"              # notes manager
cask "gpg-suite"            # gpg tool collection
cask "iterm2"               # terminal
cask "karabiner-elements"   # keyboard customizer
cask "lunar"                # monitor brightness manager
cask "michaelvillar-timer"  # timer
cask "rectangle"            # window manager
cask "rocket"               # emoji picker
cask "selfcontrol"          # website blocker



## Paid/Commercial


### Jetbrains
cask "clion"                # C++ IDE
cask "goland"               # Go IDE
cask "intellij-idea"        # Java IDE
cask "webstorm"             # JS/TS IDE


### Sublime
cask "sublime-merge"        # Git GUI
cask "sublime-text"         # Text Editor



## Mac App Store


### Apple
mas "Keynote",              id: 409183694
mas "Numbers",              id: 409203825
mas "Pages",                id: 409201541
mas "Xcode",                id: 497799835


### Paid
mas "1Blocker",             id: 1107421413        # add blocker extension for safari
mas "Pocket",               id: 568494494         # reading list app
mas "StopTheMadness",       id: 1376402589        # usability extension for safari
